{
  "title": "The Mystery of the Holy Communion",
  "lead": "The real Body and Blood of Christ, offered for the life and salvation of the world",
  "sections": [
    {
      "title": "Five Pillars of Mystery",
      "content": [
        "The Eritrean Orthodox Tewaḥdo Church teaches its faith through the Five Pillars of Mystery. Just as pillars support a roof, these divine mysteries uphold and strengthen the faith of believers. They are revealed by God, received through faith, and rooted in Holy Scripture (1 Corinthians 14:19)."
      ],
      "list": [
        "The Mystery of the Trinity",
        "The Mystery of the Incarnation",
        "The Mystery of Baptism",
        "The Mystery of the Holy Communion",
        "The Mystery of the Resurrection"
      ]
    },
    {
      "title": "The Mystery of the Holy Communion (Qurban)",
      "content": [
        "The Holy Communion (ቅዳሴ – Qəddase, also called the Eucharist) is the supreme mystery of the Church, through which believers enter into the most intimate communion with God.",
        "It is not a symbol or a mere memorial, but the true, real, and life-giving Body and Blood of our Lord, God, and Savior Jesus Christ.",
        "Our Lord Himself declared its necessity: ‘Verily, verily, I say unto you, except ye eat the flesh of the Son of Man, and drink his blood, ye have no life in you.’ (John 6:53)",
        "Through this mystery, Christ abides in us and we in Him: ‘He that eateth my flesh, and drinketh my blood, dwelleth in me, and I in him.’ (John 6:56)"
      ]
    },
    {
      "title": "Christ’s Institution of the Mystery",
      "content": [
        "On the night He was betrayed, during the Passover meal, our Lord Jesus Christ instituted the eternal mystery of the Holy Communion:",
        "‘And he took bread, and gave thanks, and brake it, and gave unto them, saying, This is my body which is given for you: this do in remembrance of me. Likewise also the cup after supper, saying, This cup is the new testament in my blood, which is shed for you.’ (Luke 22:19–20)",
        "This command was given to the Apostles, establishing the priesthood and the sacrificial liturgy that continues in the Church until the end of the age."
      ]
    },
    {
      "title": "The Real Presence of Christ",
      "content": [
        "The Eritrean Orthodox Tewaḥdo Church teaches with certainty that during the Divine Liturgy the bread and wine truly become the Body and Blood of Christ.",
        "Before the consecration, they remain ordinary bread (ቂጣ – Qita) and wine (ወይን – Wäyn). Through the prayer of the Church, the words of institution, and the invocation of the Holy Spirit (epiclesis), they are changed by divine power into the life-giving Flesh and precious Blood of Christ.",
        "This change is not symbolic or figurative, but a true mystery accomplished by the Holy Spirit through the priesthood of Christ.",
        "As taught in the Faith of the Fathers and attributed to St. Athanasius the Apostolic, the Church confesses that the elements are truly transformed into the Body and Blood of the Son of God after the blessing."
      ]
    },
    {
      "title": "The One Eternal Sacrifice",
      "content": [
        "The sacrifice offered in the Holy Communion is one and the same sacrifice as that offered by Christ on the Cross.",
        "Christ was sacrificed once for all (Hebrews 9:28). The Divine Liturgy does not repeat or add to His sacrifice, but makes present that one eternal and perfect offering through the Holy Spirit.",
        "The Body offered in the Upper Room, the Body crucified on Golgotha, and the Body received by the faithful today are one and the same.",
        "As the liturgical prayer proclaims: ‘Your own of Your own we offer to You, in all and for all.’"
      ]
    },
    {
      "title": "Old Testament Prophecies and Symbols",
      "subsections": [
        {
          "title": "Prophecies",
          "list": [
            "Psalm 4:7 – Spiritual joy surpassing earthly food",
            "Proverbs 9:1–2 – Divine Wisdom preparing a holy banquet",
            "Sirach 39:26 – Bread and wine as essential gifts sustaining life"
          ]
        },
        {
          "title": "Symbols (Types)",
          "list": [
            "The Passover Lamb (Exodus 12) – Christ the Lamb of God",
            "Melchizedek’s offering of bread and wine (Genesis 14:18)",
            "The manna in the wilderness (Exodus 16), fulfilled in Christ the Bread from Heaven (John 6)"
          ]
        }
      ]
    },
    {
      "title": "Who May Receive the Holy Communion",
      "content": [
        "The Holy Communion is the medicine of immortality and the gift of eternal life, but it must be received with faith, repentance, and reverence.",
        "Requirements for receiving the Holy Mysteries include:",
        "1. Baptism and Chrismation in the Orthodox Tewaḥdo Church.",
        "2. Faith in the Real Presence of Christ and confession of the Orthodox faith.",
        "3. Repentance and, when necessary, sacramental confession, in obedience to the Apostle’s teaching: ‘Let a man examine himself.’ (1 Corinthians 11:28)",
        "4. Observance of the Eucharistic fast, except in cases of necessity or health.",
        "5. Prayerful preparation before approaching the Holy Mysteries.",
        "Those who receive unworthily bring judgment upon themselves rather than healing (1 Corinthians 11:29).",
        "Out of reverence for the mystery and fidelity to unity of faith, Holy Communion is reserved for those in full communion with the Orthodox Tewaḥdo Church."
      ]
    },
    {
      "title": "Fruits and Effects of Holy Communion",
      "content": [
        "When received worthily, the Holy Communion grants great spiritual fruits:",
        "Remission of sins (Matthew 26:28)",
        "Eternal life (John 6:54)",
        "Union with Christ and participation in the divine life (2 Peter 1:4)",
        "Healing of soul and body",
        "Strengthening of faith, love, and unity within the Church"
      ]
    },
    {
      "title": "Witness of the Church Fathers",
      "subsections": [
        {
          "title": "St. John Chrysostom",
          "content": [
            "He teaches that it is Christ Himself who changes the gifts, while the priest serves as the visible minister of the mystery."
          ]
        },
        {
          "title": "St. Cyril of Jerusalem",
          "content": [
            "He exhorts the faithful not to judge the mystery by the senses, but to trust the words of Christ and the faith of the Church."
          ]
        },
        {
          "title": "The Liturgical Prayer",
          "content": [
            "In every Divine Liturgy, the Church prays for the Holy Spirit to descend upon the gifts and change them into the Body and Blood of Christ, expressing the faith of the whole Church."
          ]
        }
      ]
    },
    {
      "title": "Summary: The Heart of Church Life",
      "content": [
        "The Holy Communion is the center and summit of the life of the Church. In it, the mystery of the Incarnation is made present for our salvation, the sacrifice of the Cross is revealed, and the promise of the Resurrection is given.",
        "Through this heavenly food, believers are strengthened for life in this world and receive a foretaste of the eternal banquet in the Kingdom of God."
      ]
    },
    {
      "title": "Cross References",
      "content": [
        "Scripture: John 6:53–57; Matthew 26:26–28; Mark 14:22–24; Luke 22:19–20; 1 Corinthians 10:16–17; 11:23–29.",
        "Prophecies and Types: Psalm 4:7; Proverbs 9:1–2; Sirach 39:26; Exodus 12; Genesis 14:18; Exodus 16.",
        "Church Fathers and Liturgy: Ḥaymanotä Abäw (Faith of the Fathers); Mystagogical Catecheses of St. Cyril; the Anaphora of the Apostles (Mäṣḥafä Qəddase)."
      ]
    }
  ]
}
