{
  "title": "The Mystery of Baptism",
  "lead": "The sacrament of rebirth, forgiveness of sins, and entry into Christ’s life—through the priesthood of Christ",
  "sections": [
    {
      "title": "Five Pillars of Mystery",
      "content": [
        "The Eritrean Orthodox Tewaḥdo Church teaches its faith through the Five Pillars of Mystery. Like pillars supporting a roof, these mysteries uphold and strengthen believers. They are revealed by God, received by faith, and rooted in Holy Scripture (1 Corinthians 14:19)."
      ],
      "list": [
        "The Mystery of the Trinity",
        "The Mystery of the Incarnation",
        "The Mystery of Baptism",
        "The Mystery of Communion",
        "The Mystery of the Resurrection"
      ],
      "diagram": {
        "type": "five_pillars",
        "title": "Five Pillars Supporting the Faith",
        "pillars": [
          {"name": "Trinity", "description": "Foundation of all faith"},
          {"name": "Incarnation", "description": "God becomes man"},
          {"name": "Baptism", "description": "Gateway to salvation", "highlighted": true},
          {"name": "Communion", "description": "Union with Christ"},
          {"name": "Resurrection", "description": "Victory over death"}
        ],
        "roof": "Faith of the Orthodox Church"
      }
    },
    {
      "title": "The Mystery of Baptism",
      "content": [
        "Baptism is the sacrament of new birth given by our Lord Jesus Christ to His Church. Through baptism, a person is reborn of water and the Spirit, receives forgiveness of sins, is healed from the fallen nature inherited from Adam, is adopted as a child of God, and is incorporated into the Body of Christ, the Church.",
        "As the Tewaḥdo Creed confesses: ‘We believe in one baptism for the remission of sins.’",
        "Baptism is not a symbol alone, but a real and effective mystery in which God acts through material creation to grant divine life."
      ]
    },
    {
      "title": "What Christ Taught About Baptism",
      "content": [
        "Jesus Christ Himself established baptism as necessary for entering the Kingdom of God:",
        "‘Verily, verily I say unto thee, except a man is born of water and of the Spirit, he cannot enter into the kingdom of God.’ (John 3:5)",
        "Before His Ascension, He commanded the Apostles:",
        "‘Go therefore and make disciples of all nations, baptizing them in the name of the Father and of the Son and of the Holy Spirit.’ (Matthew 28:19)",
        "And He promised:",
        "‘He that believes and is baptized shall be saved.’ (Mark 16:16)"
      ]
    },
    {
      "title": "The Foundation of Faith: Trinity and Incarnation",
      "content": [
        "Because baptism is the gateway into the Church, it requires faith in the core mysteries of salvation:",
        "1. The Holy Trinity: One God in Three Persons—Father, Son, and Holy Spirit.",
        "2. The Incarnation: That the eternal Son of God truly became man for our salvation.",
        "Baptism is performed ‘in the name of the Father, and of the Son, and of the Holy Spirit’ (Matthew 28:19), which is itself a confession of the Trinity and of the incarnate Son.",
        "As Saint Paul writes: ‘With the heart one believes unto righteousness, and with the mouth confession is made unto salvation.’ (Romans 10:10). Baptism is this saving confession enacted."
      ]
    },
    {
      "title": "Who Baptizes? The Priesthood of Christ",
      "content": [
        "Baptism is administered by an ordained priest, but it is Christ Himself who baptizes through the priest. Christ is our eternal High Priest (Hebrews 4:14), and He continues His saving work in the Church through the priesthood He established.",
        "As He promised: ‘I am with you always, even to the end of the age.’ (Matthew 28:20)",
        "The priest acts in the priesthood of Christ, not by personal power. The grace of baptism comes from Christ, not from the human minister. Apostolic succession safeguards the unity, authenticity, and efficacy of the sacrament."
      ]
    },
    {
      "title": "The Manner of Baptism",
      "content": [
        "In the Orthodox Tewaḥdo tradition, baptism is normally performed by triple immersion, in the name of the Father, the Son, and the Holy Spirit.",
        "The three immersions confess the Holy Trinity, Christ’s three days in the tomb, and death, burial, and resurrection with Him.",
        "As the body is immersed into water, the old life dies; as it rises, the new life in Christ begins."
      ]
    },
    {
      "title": "Baptism and the Seal of the Holy Spirit",
      "content": [
        "Baptism is immediately followed by chrismation with the Holy Myron (Myrone).",
        "Through chrismation, the newly baptized receives the seal of the Holy Spirit, fulfilling the Lord’s words: ‘Born of water and of the Spirit.’ (John 3:5)",
        "Baptism cleanses and rebirths; chrismation strengthens, sanctifies, and consecrates the believer as a member of Christ’s royal priesthood."
      ]
    },
    {
      "title": "Why We Baptize Infants",
      "content": [
        "The Eritrean Orthodox Tewaḥdo Church baptizes infants according to the ancient Apostolic tradition.",
        "Infant baptism is rooted in the truth that salvation is a gift of grace, not a reward for intellectual maturity. Just as circumcision was given to infants under the old covenant (Genesis 17:12), baptism—the circumcision made without hands (Colossians 2:11–12)—is given freely by God.",
        "Infants are born into a fallen world and share in the fallen nature of humanity. Baptism heals this condition and grants new life in Christ.",
        "Christ said: ‘Let the little children come to Me, and do not forbid them; for of such is the kingdom of God.’ (Mark 10:14)",
        "In the Acts of the Apostles, entire households were baptized (Acts 16:15, 33; 18:8).",
        "Infants are baptized in the faith of the Church, confessed by the godparents (ኣባላት ኪዳን), who pledge to raise the child in Orthodox faith and life.",
        "Traditional timing: males on the 40th day and females on the 80th day, reflecting the Law of purification (Leviticus 12) fulfilled in Christ."
      ]
    },
    {
      "title": "The Grace of Baptism and God’s Mercy",
      "subsections": [
        {
          "title": "The Ordinary Sacrament",
          "content": [
            "Baptism by water is the only sacrament of baptism instituted by Christ and entrusted to the Church.",
            "Through it, sins are forgiven, the fallen nature is healed, the believer is united to Christ’s death and resurrection, and incorporated into the Body of Christ.",
            "This is the one baptism confessed in the Creed."
          ]
        },
        {
          "title": "Baptism by Blood (Martyrdom)",
          "content": [
            "When an unbaptized person confesses Christ unto death and is martyred for the faith, the Church believes that God may grant them the grace of baptism through martyrdom.",
            "This is not a sacrament, but an exceptional act of divine mercy.",
            "As Christ said: ‘Whoever loses his life for My sake will find it.’ (Matthew 10:39)"
          ]
        },
        {
          "title": "Baptism by Desire (God’s Merciful Provision)",
          "content": [
            "When a person has true faith, repentance, and a sincere desire for baptism, but is prevented from receiving it by circumstances beyond their control, the Church entrusts such a soul to the mercy of God.",
            "This does not replace baptism by water, but confesses that God judges the heart and is not bound by what He Himself has instituted.",
            "The promise to the thief on the cross (Luke 23:43) reveals this mercy."
          ]
        },
        {
          "title": "Important Clarification",
          "content": [
            "Baptism by blood and baptism by desire are not sacraments and do not replace baptism by water.",
            "They affirm both the necessity of baptism and the freedom and mercy of God, without contradiction."
          ]
        }
      ]
    },
    {
      "title": "What the Apostles Taught",
      "content": [
        "Saint Peter proclaimed: ‘Repent, and be baptized every one of you… for the remission of sins.’ (Acts 2:38)",
        "Saint Paul taught: ‘We were buried therefore with him by baptism into death… that we too might walk in newness of life.’ (Romans 6:3–4)",
        "He also taught: ‘Having been buried with him in baptism.’ (Colossians 2:11–12)"
      ]
    },
    {
      "title": "Old Testament Prophecies and Symbols",
      "subsections": [
        {
          "title": "Prophecy of Cleansing",
          "content": [
            "‘Then will I sprinkle clean water upon you, and ye shall be clean.’ (Ezekiel 36:25)"
          ]
        },
        {
          "title": "Noah’s Ark",
          "content": [
            "The Ark saved through water, which Saint Peter identifies as a type of baptism (1 Peter 3:20–21). The Ark is the Church, and the water is the means of salvation."
          ]
        },
        {
          "title": "Crossing the Red Sea",
          "content": [
            "The Israelites were delivered from slavery and death through the sea. Saint Paul says they were ‘baptized into Moses in the cloud and in the sea’ (1 Corinthians 10:1–2), prefiguring baptism’s liberation from sin and death."
          ]
        }
      ]
    },
    {
      "title": "Requirements for the Sacrament of Baptism",
      "list": [
        "Faith (Imnet): Confession of the Holy Trinity and the Incarnation of Christ",
        "Ordained Priest (Kahin): Acting in the priesthood of Christ",
        "Water and the Trinitarian Formula",
        "Intention of the Church to do what Christ instituted"
      ]
    },
    {
      "title": "What the Church Fathers Teach (Ḥaymanotä Abäw)",
      "subsections": [
        {
          "title": "St. Cyril of Jerusalem",
          "content": [
            "Baptism is the rebirth of the soul, the seal of eternal life, and the cleansing of the conscience before God."
          ]
        },
        {
          "title": "St. John Chrysostom",
          "content": [
            "The old man is buried in the water, and the new man rises again with Christ."
          ]
        },
        {
          "title": "St. Athanasius the Apostolic",
          "content": [
            "‘He became man that we might become divine.’ This union with Christ begins in baptism."
          ]
        },
        {
          "title": "St. Cyprian of Carthage",
          "content": [
            "Infants are not excluded from grace, for baptism heals the fallen condition inherited from Adam."
          ]
        }
      ]
    },
    {
      "title": "Summary: Why Baptism Matters",
      "subsections": [
        {
          "title": "For Salvation",
          "content": [
            "It is the door to the Kingdom of God."
          ]
        },
        {
          "title": "For Union with Christ",
          "content": [
            "It unites us to His death and resurrection."
          ]
        },
        {
          "title": "For the Church",
          "content": [
            "It incorporates us into the one Body of Christ."
          ]
        },
        {
          "title": "For Daily Life",
          "content": [
            "It grants grace to live as children of God and to grow in holiness."
          ]
        }
      ]
    },
    {
      "title": "Cross References",
      "content": [
        "Scripture: John 3:5; Matthew 28:19–20; Mark 10:14; 16:16; Acts 2:38; 16:15, 33; Romans 6:3–4; Colossians 2:11–12; 1 Peter 3:20–21; 1 Corinthians 10:1–2; Ezekiel 36:25.",
        "Creed: ‘We believe in one baptism for the remission of sins.’",
        "Fathers: Ḥaymanotä Abäw – Teachings on Baptism, Martyrdom, and Grace."
      ]
    }
  ]
}
