{
  "title": "The Mystery of the Holy Trinity",
  "lead": "Five Pillars of Mystery: The mystery of the Trinity",
  "sections": [
    {
      "title": "Introduction to the Five Pillars",
      "content": [
        "The Eritrean Orthodox Tewahdo Church has Five Pillars of Mysteries through which it teaches and demonstrates its basic religious belief. They are called Pillars of Mystery due to the fact that they support and strengthen the belief of the faithful in religious teachings just as a pillar supports a roof; These mysteries have Biblical foundation (1 Cor. 14:19).",
        "Accordingly, the five pillars of mystery are expressed in the Orthodox Tewahdo Creed, which is the confession of our faith. The five mysteries of the church are as follows:"
      ],
      "list": [
        "The mystery of the Trinity",
        "The mystery of the Incarnation", 
        "The mystery of Baptism",
        "The mystery of Communion",
        "The mystery of Resurrection"
      ]
    },
    {
      "title": "Mystery of the Holy Trinity",
      "content": [
        "In this section the mystery of Unity and Trinity of the Triune God is described. The Holy Trinity is three in name, in person, in deed and one in essence, in divinity, in existence, in will."
      ],
      "subsections": [
        {
          "title": "Three in Name:",
          "list": ["The Father", "The Son", "The Holy Spirit"]
        },
        {
          "title": "Three in Deed:",
          "list": [
            "The Father is the begetter",
            "The Son is begotten", 
            "The Holy Spirit is the one who proceeds"
          ]
        },
        {
          "title": "Three in Person:",
          "list": [
            "The Father has a perfect person",
            "The Son has a perfect person",
            "The Holy Spirit has a perfect person"
          ]
        }
      ],
      "content_after": [
        "The Father is the heart, the Son is the word and the Holy Spirit is the life (breath). The Father is the heart for Himself, and He is the heart for the Son and for the Holy Spirit. The Son is the word for Himself, and He is the word for the Father, and for the Holy Spirit. And finally, the Holy Spirit is the life (breath) for Himself, and He is the life (breath) for the Father and the Son."
      ]
    },
    {
      "title": "The Oneness of the Trinity",
      "content": [
        "Even though we say the Trinity are three in name, in deed and in person; the Holy Trinity is also One as well. They are:"
      ],
      "list": [
        "One in essence",
        "One in divinity", 
        "One in existence",
        "One in will"
      ],
      "content_after": [
        "When an Orthodox Tewahdo believer says they believe in the Holy Trinity, it is not to say they believe in three Gods but one God. While the Father and the Son and the Holy Spirit exist in their own perfect person, they are one in existence."
      ]
    },
    {
      "title": "Biblical Foundation",
      "bible_references": {
        "Old Testament References:": [
          "Genesis 1:26; 2:18; 3:22; 11:7; 18:1-8",
          "Psalm 33:6; 146:5",
          "Isaiah 6:3,8"
        ],
        "New Testament References:": [
          "Matthew 3:16-17; 28:19",
          "John 14:26",
          "2 Corinthians 14:13",
          "1 Peter 1:2",
          "1 John 5:7-8"
        ]
      }
    },
    {
      "title": "Symbolic Metaphor: The Sun",
      "content": [
        "There are many ways that the mystery of the Holy Trinity can be symbolized. For example, often times The Sun is used as metaphor to explain Qiddus Selassie or the Holy Trinity. The Sun can be described in three ways: its form, Light and warmth (heat).",
        "Our fathers explain that its form is like the Father, the Light being the Son and the Warmth (heat) being the Holy Spirit. Just as one cannot separate the physical form of the Sun away from the light or warmth it gives, the same can be said of the Holy Trinity. The Holy Trinity describes the Father, the Son and the Spirit as being three while also being One. One cannot exist without the other two."
      ]
    }
  ]
}