{
  "title": "The Mystery of the Resurrection",
  "lead": "Christ’s victory over death and the hope of eternal life for all humanity",
  "sections": [
    {
      "title": "Five Pillars of Mystery",
      "content": [
        "The Eritrean Orthodox Tewaḥdo Church teaches its faith through the Five Pillars of Mystery. Just as pillars support a roof, these divine mysteries uphold and strengthen the faith of believers. They are called mysteries because they are revealed by God, received through faith, and rooted in Holy Scripture (1 Corinthians 14:19)."
      ],
      "list": [
        "The Mystery of the Trinity",
        "The Mystery of the Incarnation",
        "The Mystery of Baptism",
        "The Mystery of Holy Communion",
        "The Mystery of the Resurrection"
      ]
    },
    {
      "title": "The Mystery of the Resurrection of the Dead",
      "content": [
        "The Resurrection is the mystery of life conquering death. It is God’s definitive victory over corruption and the fulfillment of His promise of eternal life.",
        "This mystery proclaims that death is not the end. The soul is immortal, and on the Last Day it will be reunited with the body, which will be raised and transformed for eternal destiny.",
        "The foundation of this hope is the historical and saving event of Christ’s Resurrection: ‘But now is Christ risen from the dead, and become the firstfruits of them that slept.’ (1 Corinthians 15:20)"
      ]
    },
    {
      "title": "Christ’s Resurrection: Foundation and Firstfruits",
      "content": [
        "The resurrection of the dead is not a philosophical idea, but a reality revealed and confirmed by the resurrection of our Lord Jesus Christ.",
        "If Christ were not raised, the preaching of the Apostles and the faith of the Church would be empty (1 Corinthians 15:14). But Christ is risen, and His resurrection is both the guarantee and the model of our own resurrection.",
        "As taught in the Apostolic tradition and echoed by the Church Fathers, Christ rose from the dead to reveal and secure the future resurrection of the human body."
      ]
    },
    {
      "title": "The Universal Resurrection and the Intermediate State",
      "content": [
        "The Resurrection is universal. All humanity—righteous and unrighteous—will be raised by the voice of the Son of God.",
        "‘The hour is coming, in which all that are in the graves shall hear his voice, and shall come forth; they that have done good, unto the resurrection of life; and they that have done evil, unto the resurrection of judgment.’ (John 5:28–29)",
        "From death until the Last Day, the soul exists consciously in an intermediate state. The righteous abide in peace and rest in Paradise, often called the Bosom of Abraham (Luke 16:22; 23:43), while the unrepentant experience Hades, a state of separation and distress (Luke 16:23).",
        "This intermediate state is not final. At the Second Coming of Christ, all souls will be reunited with their bodies in the General Resurrection."
      ]
    },
    {
      "title": "Old Testament Prophecies and Foretastes",
      "subsections": [
        {
          "title": "Prophecies of the Resurrection",
          "list": [
            "Deuteronomy 32:39 – God alone holds power over life and death",
            "Isaiah 26:19 – The earth giving birth to the dead",
            "Daniel 12:2–3 – Resurrection to eternal life or shame",
            "Job 19:25–26 – The confession of bodily resurrection"
          ]
        },
        {
          "title": "Foretastes of Resurrection Power",
          "list": [
            "The raising of the dead by Elijah and Elisha (1 Kings 17; 2 Kings 4; 13)",
            "The resurrections performed by Christ during His earthly ministry (Matthew 9; Luke 7; John 11)",
            "The Apostolic resurrections through Peter and Paul (Acts 9; Acts 20)",
            "The rising of the saints at Christ’s death (Matthew 27:52)"
          ]
        }
      ]
    },
    {
      "title": "The Nature of the Risen Body",
      "content": [
        "The Apostle Paul teaches that the resurrection body is not a mere reanimation of the corpse, but a transformation into a glorified and spiritual body.",
        "‘It is sown in corruption; it is raised in incorruption… It is sown a natural body; it is raised a spiritual body.’ (1 Corinthians 15:42–44)",
        "The risen body will be incorruptible, glorious, powerful, and fully animated by the Holy Spirit, perfectly united to the soul.",
        "The righteous will shine with divine glory according to their communion with God (Matthew 13:43), while the unrighteous will bear the consequences of their separation from Him."
      ]
    },
    {
      "title": "The Last Judgment and Eternal Destiny",
      "content": [
        "Following the General Resurrection, Christ will come in glory to judge the living and the dead.",
        "‘When the Son of Man shall come in his glory… before him shall be gathered all nations.’ (Matthew 25:31–32)",
        "All will be judged according to truth: by their deeds, by the light given to them, and by their response to God’s grace (Romans 2:14–16; 2 Corinthians 5:10).",
        "The righteous will inherit eternal life in the Kingdom of God, a life of unending communion with the Holy Trinity (Matthew 25:34).",
        "The unrepentant will enter eternal separation from God, a state described by Scripture as Gehenna (Matthew 25:46)."
      ]
    },
    {
      "title": "Why the Resurrection Matters Now",
      "content": [
        "The mystery of the Resurrection shapes Christian life in the present:",
        "It overcomes the fear of death, which becomes a passage to life in Christ.",
        "It gives meaning to suffering and struggle, which are not in vain.",
        "It sanctifies the body, which is destined for glory.",
        "It calls believers to holy and watchful living.",
        "It is the goal toward which all the sacraments lead: Baptism unites us to Christ’s death and resurrection, and Holy Communion nourishes us with the medicine of immortality."
      ]
    },
    {
      "title": "Witness of the Church Fathers",
      "subsections": [
        {
          "title": "St. John Chrysostom",
          "content": [
            "In his Paschal Homily, he proclaims the defeat of death and the universal triumph of Christ’s Resurrection."
          ]
        },
        {
          "title": "St. Athanasius the Apostolic",
          "content": [
            "In On the Incarnation, he teaches that Christ assumed our mortality in order to destroy death and restore humanity to immortality."
          ]
        },
        {
          "title": "St. Paul the Apostle",
          "content": [
            "In 1 Corinthians 15, he presents the Resurrection as the heart of the Gospel and the victory granted to humanity through Christ."
          ]
        }
      ]
    },
    {
      "title": "Summary: The Fulfillment of All Mysteries",
      "content": [
        "The Mystery of the Resurrection is the culmination of all the Pillars of Mystery.",
        "The Trinity is the source of life; the Incarnation is God entering death; Baptism is our personal participation in resurrection; Holy Communion is our nourishment for eternal life.",
        "The entire faith, worship, and hope of the Eritrean Orthodox Tewaḥdo Church is shaped by the Resurrection. We do not only believe in it—we live it, celebrate it, and await its glorious fulfillment, when God will be all in all (1 Corinthians 15:28)."
      ]
    },
    {
      "title": "Cross References",
      "content": [
        "Scripture – Prophecy: Deuteronomy 32:39; Isaiah 26:19; Daniel 12:2–3; Job 19:25–26.",
        "Scripture – Teaching: John 5:28–29; 1 Corinthians 15; Matthew 25:31–46; 2 Corinthians 5:10; Revelation 20:11–15.",
        "Church Fathers: Paschal Homily of St. John Chrysostom; St. Athanasius, On the Incarnation.",
        "Liturgy: Funeral and Resurrection prayers of the Tewaḥdo Divine Liturgy."
      ]
    }
  ]
}
