{
  "id": "about-our-faith-qa",
  "title": "About Our Faith - Frequently Asked Questions",
  "subtitle": "Common Questions About Orthodox Tewahdo Beliefs and Practices",
  "author": "Church Teaching Committee",
  "date": "2024-01-31",
  "category": "qa",
  "tags": ["FAQ", "faith", "Orthodox", "Tewahdo", "Trinity", "Five Pillars", "salvation"],
  "excerpt": "Answers to frequently asked questions about Orthodox Tewahdo faith, beliefs, and theological foundations.",
  "reading_time": "8 min read",
  "sections": [
    {
      "title": "What is the Holy Trinity?",
      "content": [
        "The Holy Trinity is the fundamental doctrine of Orthodox Christianity, teaching that God exists as **three distinct Persons in one divine essence**: the Father, the Son (Jesus Christ), and the Holy Spirit.",
        "In Orthodox Tewahdo theology, we understand the Trinity as **three Persons sharing one divine nature**, each fully God yet distinct in their roles. The Father is the source, the Son is begotten of the Father, and the Holy Spirit proceeds from the Father.",
        "**For detailed teaching on the Trinity**, please see our comprehensive guide: [The Mystery of the Trinity](#tewahdo-haymanot) in the Five Pillars section."
      ]
    },
    {
      "title": "What are the Five Pillars of Tewahdo Faith?",
      "content": [
        "The **Five Pillars of Mystery** are the foundational teachings of the Orthodox Tewahdo Church. They are called 'pillars' because they support the faith of believers, and 'mysteries' because they are divine truths revealed by God.",
        "The Five Pillars are:",
        "1. **The Mystery of the Trinity** - God as three Persons in one essence",
        "2. **The Mystery of the Incarnation** - God becoming man for our salvation", 
        "3. **The Mystery of Baptism** - Spiritual rebirth and entry into the Church",
        "4. **The Mystery of Communion** - Receiving the Body and Blood of Christ",
        "5. **The Mystery of Resurrection** - Christ's victory over death and our hope",
        "**For complete teachings on all Five Pillars**, visit our [Təmhərte Ḥaymanot](#tewahdo-haymanot) section with detailed explanations and theological insights."
      ]
    },
    {
      "title": "How does the Orthodox Tewahdo Church understand salvation?",
      "content": [
        "Orthodox Tewahdo theology teaches that **salvation is both a gift from God and requires our active participation**. We are saved by God's grace through faith, but this salvation is worked out through our entire life of faith, worship, and good works.",
        "Key aspects of Orthodox salvation include:",
        "- **Theosis (Deification)**: Becoming partakers of the divine nature through God's grace",
        "- **Sacramental Life**: Receiving grace through baptism, communion, and other sacraments",
        "- **Ascetic Struggle**: Fasting, prayer, and spiritual discipline to purify the soul",
        "- **Community Worship**: Participating in the liturgical life of the Church",
        "**For more detailed theological discussion**, see our upcoming article on Orthodox soteriology and the path to salvation."
      ]
    },
    {
      "title": "What are the main differences between Orthodox Tewahdo and other Christian traditions?",
      "content": [
        "The Orthodox Tewahdo Church maintains several distinctive characteristics:",
        "**Christological Position**: We hold to **Miaphysite Christology**, teaching that Christ has one united nature that is both divine and human, without separation or confusion.",
        "**Liturgical Tradition**: Our **Divine Liturgy (Kidase)** is celebrated in Ge'ez, preserving ancient Christian worship traditions dating back to the early centuries.",
        "**Fasting Practices**: We observe **extensive fasting periods** throughout the year, including the 55-day Lent and other traditional fasts.",
        "**Sacramental Life**: We recognize **seven sacraments** and emphasize their role in spiritual growth and salvation.",
        "**Ecclesiastical Calendar**: We follow the **ancient Julian calendar** for calculating feast days and liturgical seasons.",
        "**For comprehensive comparison with other traditions**, see our upcoming comparative theology article series."
      ]
    }
  ],
  "related_articles": ["understanding-kidase", "orthodox-fasting-periods", "apostolic-memory-aksumite-turning-point"]
}